skeleton/app/controllers/follows_controller.rb

INSERT INTO "follows" ("followee_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["followee_id", 8], ["follower_id", 9], ["created_at", "2019-07-10 18:00:10.822684"], ["updated_at", "2019-07-10 18:00:10.822684"]]
---
  def create
    # simulate latency
    # sleep(1)

    @follow = current_user.out_follows.create!(followee_id: params[:user_id])

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 2]]
---
  def destroy
    # simulate latency
    # sleep(1)

    @follow = current_user.out_follows.find_by(followee_id: params[:user_id])
    # debugger
    @follow.destroy!